In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
     'city' : ['Delhi', 'Up', 'Delhi', 'Mumbai', 'Up', 'Delhi'],
     'price' : [233,455,772,334,323,443]
})

In [3]:
df

     city  price
0   Delhi    233
1      Up    455
2   Delhi    772
3  Mumbai    334
4      Up    323
5   Delhi    443

In [4]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [5]:
mean_price

{'Delhi': 482.6666666666667, 'Mumbai': 334.0, 'Up': 389.0}

In [7]:
df['encoded_'] = df['city'].map(mean_price)
df

     city  price    encoded_
0   Delhi    233  482.666667
1      Up    455  389.000000
2   Delhi    772  482.666667
3  Mumbai    334  334.000000
4      Up    323  389.000000
5   Delhi    443  482.666667

In [12]:
import seaborn as sns
df_tip = sns.load_dataset('tips')
print(df_tip)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [15]:
mean_tip = df_tip.groupby('time', observed=True)['total_bill'].mean().to_dict()

In [16]:
mean_tip

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [20]:
df_tip['encoded_timetip'] = df_tip['time'].map(mean_tip)
df_tip

     total_bill   tip     sex smoker   day    time  size encoded_timetip
0         16.99  1.01  Female     No   Sun  Dinner     2       20.797159
1         10.34  1.66    Male     No   Sun  Dinner     3       20.797159
2         21.01  3.50    Male     No   Sun  Dinner     3       20.797159
3         23.68  3.31    Male     No   Sun  Dinner     2       20.797159
4         24.59  3.61  Female     No   Sun  Dinner     4       20.797159
..          ...   ...     ...    ...   ...     ...   ...             ...
239       29.03  5.92    Male     No   Sat  Dinner     3       20.797159
240       27.18  2.00  Female    Yes   Sat  Dinner     2       20.797159
241       22.67  2.00    Male    Yes   Sat  Dinner     2       20.797159
242       17.82  1.75    Male     No   Sat  Dinner     2       20.797159
243       18.78  3.00  Female     No  Thur  Dinner     2       20.797159

[244 rows x 8 columns]